# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

a = input('введите числа: ').split()
b = []

for _ in range(len(a)):
    if len(a) >= 2:
        b.append(int(a[0]) * int(a[-1]))
        a.remove(a[0])
        a.remove(a[-1])
    elif len(a) == 1:
        b.append(int(a[0])**2)
        a.remove(a[0])
    else:
        break
print(b)
    
